## Production: route53
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 4 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |               NAME               |
|--------|----------------------------------|
| add    | `aws_route53_record.ca_cdn_NS`   |
|        | `aws_route53_zone.ca_cdn`        |
|        | `aws_route53_zone.ca_website_en` |
|        | `aws_route53_zone.ca_website_fr` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.ca_cdn_NS will be created
  + resource "aws_route53_record" "ca_cdn_NS" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "cdn.design-system.canada.ca"
      + records         = [
          + "ns-111.awsdns-13.com",
          + "ns-1114.awsdns-11.org",
          + "ns-2010.awsdns-59.co.uk",
          + "ns-830.awsdns-39.net",
        ]
      + ttl             = 300
      + type            = "NS"
      + zone_id         = "Z0225690P46Z6VL70HFE"
    }

  # aws_route53_zone.ca_cdn will be created
  + resource "aws_route53_zone" "ca_cdn" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "cdn.design-system.canada.ca"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags                = {
          + "CostCentre" = "gc-design-system-production"
          + "Terraform"  = "true"
        }
      + tags_all            = {
          + "CostCentre" = "gc-design-system-production"
          + "Terraform"  = "true"
        }
      + zone_id             = (known after apply)
    }

  # aws_route53_zone.ca_website_en will be created
  + resource "aws_route53_zone" "ca_website_en" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "design-system.canada.ca"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags                = {
          + "CostCentre" = "gc-design-system-production"
          + "Terraform"  = "true"
        }
      + tags_all            = {
          + "CostCentre" = "gc-design-system-production"
          + "Terraform"  = "true"
        }
      + zone_id             = (known after apply)
    }

  # aws_route53_zone.ca_website_fr will be created
  + resource "aws_route53_zone" "ca_website_fr" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "systeme-design.canada.ca"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags                = {
          + "CostCentre" = "gc-design-system-production"
          + "Terraform"  = "true"
        }
      + tags_all            = {
          + "CostCentre" = "gc-design-system-production"
          + "Terraform"  = "true"
        }
      + zone_id             = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + hosted_zone_id_ca_cdn        = (known after apply)
  + hosted_zone_id_ca_website_en = (known after apply)
  + hosted_zone_id_ca_website_fr = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
